{
    "Sampling, quantization, full-scale mapping.xlsx": [
        "Which serial protocol does the MCP3208 ADC use?",
        "What interface type is typical for a parallel ADC like the AD9280?",
        "What is the resolution (in bits) of the MCP3208 ADC?",
        "What is the maximum sampling rate for MCP3208 (at 5 V)?",
        "For an STM32 ADC, the total conversion time (in ADC clock cycles) is:",
        "Why might you avoid choosing a very high resolution ADC for a low‑end embedded board?",
        "Which is a drawback of parallel ADCs in microcontroller systems?",
        "One advantage of serial ADCs over parallel ADCs is:",
        "The AD9280 ADC is an example of which type?",
        "Which characteristic best describes a “high‑speed” ADC in industrial use?",
        "Which ADC supports both serial and parallel interface configurations?",
        "What is the resolution (in bits) of the NCD9830 ADC?",
        "Which interface does the NCD9830 ADC use?",
        "What is the sampling rate of the AD9280?",
        "How many analog input channels does the MCP3208 provide?",
        "At VDD = 2.7 V, what is the maximum sampling rate of MCP3208?",
        "What internal architecture does the AD9280 use?",
        "In parallel ADCs, how is the digital output transmitted?",
        "How many discrete codes does an 8‑bit ADC produce?",
        "According to Nyquist theorem, the sampling rate must be at least:"
    ],
    "Advanced pheripherals.xlsx": [
        "What is the standard voltage supply for USB 2.0?",
        "What is the maximum voltage supported by USB Power Delivery (PD)?",
        "Which USB version introduced up to 40 Gbps transfer speed?",
        "Which USB version first supported 480 Mbps speed?",
        "Which chip family is commonly used for USB interfacing?",
        "What is the typical common mode voltage of CAN signaling?",
        "What is the maximum speed of Classical CAN?",
        "Which CAN standard allows speeds up to 5 Mbps?",
        "Which CAN state occurs when CAN_H is higher than CAN_L?",
        "What is the main application of CAN in EVs?",
        "What is the purpose of a USB–UART interface chip?",
        "Which chip is commonly used for USB–UART conversion?",
        "What does UART stand for?",
        "Which of the following is a typical baud rate for UART communication?",
        "What is UART commonly used for in EV systems?",
        "What type of signaling does Ethernet use?",
        "Which of the following is an Ethernet PHY chip?",
        "Which microcontroller series often includes Ethernet MAC support?",
        "What is a common application of Ethernet in EVs?",
        "Which standard Ethernet speed is often used in automotive systems?"
    ],
    "Microcontroller selection and peripheral interfacing.xlsx": [
        "Which type of microcontroller is most commonly used in IoT devices?",
        "Which microcontroller type is generally used in high-performance embedded systems like networking equipment?",
        "What is the typical clock speed range for a 32-bit microcontroller?",
        "Which type of microcontroller is best suited for cost-sensitive toys or simple household devices?",
        "Which microcontroller type is mostly considered legacy and used in older designs?",
        "Which type of memory is mainly used for storing program code in microcontrollers?",
        "When large buffering or graphics storage is needed, which memory is typically used externally with microcontrollers?",
        "Which memory type retains data without power and is commonly used for calibration values?",
        "Which high-speed interface is often used to connect external flash to microcontrollers?",
        "If a design requires large program code storage beyond internal limits, what is typically added?",
        "Which peripheral converts analog signals into digital data?",
        "Which interface is most suitable for long-distance industrial communication?",
        "Which peripheral is essential for generating analog outputs from digital signals?",
        "Which interface allows easy connection between multiple ICs over two wires?",
        "Which specialized peripheral is needed for motor control applications?",
        "Which mode reduces microcontroller energy usage while keeping key functions active?",
        "Which type of controller is most suitable for a fitness tracker that requires long battery life?",
        "Which factor most affects PCB layer count in microcontroller design?",
        "What is the key measure when balancing cost and design features in microcontroller choice?",
        "Which aspect of development can add hidden cost beyond the chip price?"
    ],
    "Cross funcational knowleedge for Product developer.xlsx": [
        "Which parameter defines how well an antenna directs energy in a specific direction?",
        "What does the azimuth of an antenna describe?",
        "Which parameter of an antenna describes its vertical angle of coverage?",
        "Which interface is commonly used for debugging microcontrollers?",
        "What must be provided on the PCB to support hardware debugging tools like PICkit 4?",
        "Which tool integrates editing, compiling, and debugging for embedded software?",
        "What does SWD stand for in hardware debugging?",
        "Which specification is most important for USB signals on a PCB?",
        "Why is Design for Manufacturing (DFM) important in PCB development?",
        "Which type of nets should be highlighted as critical in PCB specifications?",
        "Which PCB parameter is mainly determined by the current carrying requirement?",
        "Which mechanical consideration is critical for ensuring electronic product reliability?",
        "Which manufacturing method is commonly used for plastic enclosures?",
        "In a plastic enclosure, which feature is essential for fastening the PCB?",
        "Which method is used for forming enclosures from sheet metal?",
        "Which plastic material is commonly used for durable electronic enclosures?",
        "What is the purpose of ribs in plastic enclosures?",
        "Why is tolerance knowledge important in mechanical design?"
    ],
    "Product qualification standards.xlsx": [
        "What is the main purpose of ISO 9001?",
        "What does ISO 13485 mainly address?",
        "IATF 16949 applies mainly to which sector?",
        "What is the main emphasis of AS 9100?",
        "What is ISO 14001 designed for?",
        "What does RoHS restrict?",
        "What is REACH mainly related to?",
        "The WEEE directive promotes:",
        "What does EMI stand for?",
        "What does EMC ensure?",
        "CISPR 32 is used to:",
        "What does IEC 61000 specify?",
        "What does ISO 11452 evaluate?",
        "Which standard limits emissions in U.S. communication devices?",
        "The CE mark on a product means:",
        "What does UL certification ensure?",
        "The FCC mark relates to:",
        "BIS mark confirms:",
        "Why is pre-compliance testing important?",
        "Which design technique reduces EMI effects?"
    ],
    "packaging choices and ergonomic design.xlsx": [
        "What is the main role of an enclosure in electronic product design?",
        "Why is aesthetic design important in electronic enclosures?",
        "Which factor directly affects product reliability in enclosure design?",
        "When is an open-frame enclosure preferred?",
        "What is the main advantage of sealed enclosures?",
        "Which material provides the best E M I shielding?",
        "Which material is most suitable for low-cost handheld devices?",
        "Why are composite materials used in packaging?",
        "Which property is most important for heat dissipation in enclosures?",
        "What does an I P rating indicate?",
        "What is the main purpose of ergonomic design?",
        "Which factor determines ergonomic placement of controls?",
        "Why is tactile feedback important in ergonomic design?",
        "What can poor ergonomic design lead to?",
        "For which product type is ergonomic design most critical?",
        "Which standard deals with ergonomic design of human-system interaction?",
        "Which organization defines enclosure safety and environmental protection standards?",
        "Which standards specify electrical material insulation testing?",
        "Why do engineers use simulation in enclosure design?",
        "Why are case studies used in packaging and ergonomics training?"
    ],
    "Softskills requried for Electronic product developer.xlsx": [
        "What is the most effective way to confirm understanding during technical discussions?",
        "What structure is most effective for delivering quick verbal project updates?",
        "Why is version control important in engineering documentation?",
        "What should be the focus of effective technical emails?",
        "Why should an engineer learn basic terms used by other teams like mechanical or firmware?",
        "What builds trust in cross-functional collaboration?",
        "What is the first step in structured problem solving?",
        "Why is maintaining a test log important?",
        "Why is quick prototyping encouraged in design thinking?",
        "What should always be central in design thinking?",
        "How does using checklists help in hardware reviews?",
        "Why should large projects be divided into smaller deliverables?",
        "What is the primary purpose of tracking milestones in a project?",
        "What is the best way to communicate with non-technical stakeholders?",
        "Why should test plans be written with detailed steps?",
        "Why are visuals preferred over dense text in technical presentations?",
        "What makes an engineer more persuasive during a negotiation?",
        "What characterizes effective leadership feedback?",
        "Why is continuous learning vital in electronics development?",
        "What defines professionalism in an engineering environment?"
    ],
    "GPIO Hardware design.xlsx": [
        "What does GPIO stand for?",
        "Which of the following is a role of GPIO in microcontrollers?",
        "Which function can a multiplexed GPIO pin perform?",
        "What is the advantage of dedicated GPIO pins?",
        "What are the common GPIO operating voltages?",
        "Why is voltage translation important for GPIOs?",
        "What happens if a 5V signal is fed into a 3.3V GPIO pin without protection?",
        "Which of the following standards does GPIO voltage usually comply with?",
        "What is the characteristic of a GPIO in input mode?",
        "Which of the following defines push-pull output?",
        "What is the typical resistance of inbuilt pull-up resistors in microcontrollers?",
        "Why are pull-down resistors used in GPIO circuits?",
        "Which software technique is used to handle switch bounce?",
        "Which tool can be used to test GPIO functionality?",
        "What component is commonly used for ESD protection of GPIO pins?",
        "Why should unused GPIOs be configured properly?",
        "What is the purpose of a series resistor on a GPIO pin?",
        "Which factor is important for signal integrity on high-speed GPIOs?",
        "What is the role of decoupling capacitors near GPIO supply pins?",
        "How can back-feeding through GPIOs be avoided?"
    ],
    "Structured writing, BOM definition, architecture diagrams.xlsx": [
        "Which parameter is NOT usually part of a resistor entry in a BOM?",
        "For a capacitor labeled 100 nF ±10%, what is its minimum capacitance value?",
        "Which component would typically have a datasheet specifying forward voltage and current rating?",
        "Which information is essential to avoid errors during component procurement?",
        "In a BOM, 'Vendor' refers to:",
        "Which file format is universally used to describe PCB copper and solder mask layers?",
        "Which document provides spacing rules for PCB traces and clearances?",
        "What does 'Design for Manufacturability' primarily ensure in PCB design?",
        "Which type of file is needed to specify hole sizes for PCB drilling?",
        "Which checklist is reviewed before approving a PCB design for manufacturing?",
        "Which document defines the scope, objectives, and resources needed for testing?",
        "Which activity verifies that the design matches its specifications?",
        "Which document links requirements directly to test cases?",
        "What type of test ensures proper communication between subsystems after integration?",
        "Which report summarizes observed results versus expected outcomes after testing?",
        "Which standard defines general requirements for PCB design?",
        "Which compliance restricts hazardous substances in electronics manufacturing?",
        "Which flammability standard tests materials used in electronics?",
        "Which FCC regulation limits electromagnetic emissions from digital devices?",
        "Which standard defines safety requirements for medical electronic equipment?"
    ],
    "Using DMM.xlsx": [
        "Which of the following best defines D M M accuracy?",
        "Why do D M M specifications often include a “+ counts” or “+ digits” term?",
        "A meter gives 5.00 V on a 10 V range and states accuracy ±0.1 % of reading. What is the possible error bound in volts?",
        "Which factor does not generally affect the accuracy spec of a D M M?",
        "What does “resolution” of a D M M refer to?",
        "A D M M with 200,000 counts has better resolution than one with 20,000 counts because it can show smaller steps. True or false?",
        "If a 6½‑digit D M M shows many decimal places but has ±0.5 % accuracy, what is true?",
        "If a D M M is specified as 50,000 counts, it can display values from 0 up to 49,999 before changing range.",
        "Why is input impedance high (e.g. 10 MΩ) desirable for D M M in voltage mode?",
        "What happens if a D M M had only 1 kΩ input impedance instead of 10 MΩ when measuring a high resistance source?",
        "Which pair most affects loading of the circuit under test?",
        "If you measure a 1 MΩ resistor with a D M M of 1 MΩ input impedance, what issue arises?",
        "What does the “sampling rate” of a digital multimeter represent?",
        "Why is a high sampling rate beneficial when measuring rapidly changing signals?",
        "What is a potential drawback of low sampling rate in a D M M?",
        "Which order of magnitude is a realistic sampling rate for a high‑end bench D M M?",
        "If a D M M uncertainty is stated ±(2 % + 3 digits) and measured 10.00 V on 1 V least digit 0.01 V, what is absolute uncertainty?",
        "When measuring a square wave with fast edges, what is advantage of high sampling rate?"
    ],
    "Using signal generator  funcation generator for testing.xlsx": [
        "Which waveform is not normally built into a basic function generator?",
        "Which basic internal waveform is generated by an integrator in a function generator?",
        "Which block is used to convert the triangle waveform into a square wave?",
        "Which parameter is meaningful only for square or pulse output waveforms?",
        "Which component adjusts the amplitude of the output signal just before it is sent out?",
        "Which block enables A M or F M modulation of a signal in a function generator?",
        "Which block boosts the signal amplitude after modulation or shaping?",
        "Which block adjusts the signal’s frequency under control voltage influence?",
        "What effect does the offset control produce on the waveform?",
        "Which control adjusts how “strong” the output signal is, in terms of voltage magnitude?",
        "Which control determines how many times the waveform repeats per second?",
        "Which control is used to fine‑tune rise vs fall durations of a waveform?",
        "Which is a common use of function generator during the prototype phase?",
        "Which test is commonly performed by applying a known waveform to an amplifier and measuring the output?",
        "Which technique is used to measure how response changes with frequency in a circuit?",
        "How are square wave outputs from a function generator often used in digital electronics testing?",
        "What is the purpose of a “High‑Z” output mode on some function generators?",
        "Which method is commonly used in modern digital function generators to synthesize waveforms?",
        "What distinguishes a sawtooth waveform from a triangle waveform?",
        "Which circuit type is commonly tested using generated waveforms from a function generator?"
    ],
    "Using oscilloscope for testing and troubleshooting.xlsx": [
        "What does an oscilloscope primarily display?",
        "In an oscilloscope, which axis represents time?",
        "What is the main function of a Digital Storage Oscilloscope (D S O)?",
        "Which type of oscilloscope allows simultaneous analog and digital signal observation?",
        "What does the vertical control on an oscilloscope adjust?",
        "What is the role of the trigger in an oscilloscope?",
        "Why are x10 probes used in oscilloscopes?",
        "Which parameter measures how fast a signal changes state?",
        "RMS voltage of a signal indicates what?",
        "What does a flat line on an oscilloscope generally indicate?",
        "A noisy waveform indicates what issue?",
        "What does a clipped signal suggest?",
        "What causes distorted pulse waveforms?",
        "In a power supply test, what does excessive ripple indicate?",
        "Why are differential probes used in oscilloscope measurements?",
        "Why is probe calibration important?",
        "The FFT mode on a D S O is used for what purpose?",
        "What does duty cycle represent in a PWM waveform?",
        "What is one main use of oscilloscopes during product validation?",
        "What safety measure should be followed while connecting oscilloscope probes?"
    ],
    "Validation strategy, basic lab measurements.xlsx": [
        "Which document links requirements to specific test cases?",
        "What should be defined upfront in a test plan to determine pass/fail?",
        "What does the “scope” section of a test plan specify?",
        "Why is a traceability matrix critical in validation?",
        "Which check is part of smoke testing?",
        "Why are smoke tests performed before functional validation?",
        "Which parameter is checked during bring-up?",
        "Which interface check is included in smoke testing?",
        "Which instrument is best to observe noise spikes on a digital clock signal?",
        "Which instrument should be used to debug parallel bus timing?",
        "Which instrument is used to measure harmonic distortion?",
        "Which instrument is used to inject a sinusoidal waveform into a circuit?",
        "Which instrument validates signal integrity of RF traces?",
        "Which instrument is used for thermal cycling tests?",
        "Where are EMI/EMC pre-compliance scans performed?",
        "Which is an example of mechanical qualification?",
        "Which test checks insulation resistance under high voltage?",
        "Which test predicts long-term hardware reliability?",
        "Which standard test measures IP (Ingress Protection) rating?",
        "What is the goal of qualification testing?"
    ],
    "Architecture documents, interface specs, pin multiplexing plan.xlsx": [
        "What is the primary purpose of a system block diagram?",
        "Which blocks should be given highest attention in early design?",
        "Why is defining interfaces early important?",
        "What does SWaP stand for in requirements?",
        "Which factor relates to how long a product must remain functional?",
        "Which blocks are essential in a microcontroller?",
        "Which buses are present in a microcontroller?",
        "Which architecture is common in general purpose processors?",
        "What does UART stand for?",
        "Which feature allows in-field MCU firmware update?",
        "Where should decoupling capacitors be placed?",
        "What must be ensured in differential pair routing?",
        "Why is a ground plane important?",
        "What is the role of thermal vias?",
        "What does DFT stand for in PCB design?",
        "What is a key trade-off in COTS vs in-house PCB?",
        "Which frequency band does ESP8266 Wi-Fi module operate in?",
        "Which Wi-Fi standards are supported by ESP8266?",
        "What is critical in a Li-ion battery pack design?",
        "Which spec indicates how long a battery supplies current?"
    ],
    "Antenna matching, connector standards, PCB routing near antennas.xlsx": [
        "Which module supports both Wi-Fi and BLE?",
        "Which wireless protocol is best suited for phone-to-sensor low-energy communication?",
        "Which of these is a mesh networking protocol?",
        "Which standard is typically used for local high-throughput applications like streaming?",
        "Which protocol is commonly integrated in Nordic nRF52840?",
        "Which module family is based on Semtech SX1276 chip?",
        "What is the typical range achievable with LoRa in line-of-sight?",
        "Which LPWAN technology requires operator network presence like Sigfox?",
        "Which parameter is most restricted in EU LoRa devices?",
        "Which LPWAN option is license-free and widely adopted?",
        "Which module is typically used for LTE-M / NB-IoT connectivity?",
        "Which u-blox family provides NB-IoT modules?",
        "Which cellular technology is optimized for low-power IoT devices?",
        "Which of the following modules requires SIM provisioning?",
        "What is a typical peak current requirement of cellular IoT modules during TX?",
        "Which integration strategy is fastest to market?",
        "What is the standard characteristic impedance for RF design?",
        "Which network is commonly used for impedance matching in antennas?",
        "Why are decoupling capacitors used near module power pins?",
        "Which connector is commonly used for external antennas on modules?"
    ],
    "Sensor signal processing, amplifier_filter selection.xlsx": [
        "An LM35 temperature sensor gives 10 millivolt per degree Celsius. What will be its output at 25 °C?",
        "Which of these sensors shows a non-linear output response?",
        "What is the standard industrial current loop range?",
        "Which sensor changes resistance with applied mechanical strain?",
        "Which type of sensor generates a current directly in response to light?",
        "What is the main purpose of signal conditioning?",
        "Why is a resistor used with 4–20 mA current loop sensors before feeding into an ADC?",
        "What role does a low-pass filter play before an ADC?",
        "What property is most important when selecting an op-amp for precision sensor amplification?",
        "Why are instrumentation amplifiers used with bridge sensors?",
        "What is the voltage resolution (LSB) of a 12-bit ADC with 3.3 V reference?",
        "A sensor gives 0.5 V to 1.5 V output. The ADC requires 0–5 V input. What must be done?",
        "Why must sensor range be mapped to ADC range?",
        "What is the resolution of a 10-bit ADC with 5 V reference?",
        "If a 4–20 mA loop is passed through a 250 Ω resistor, what voltage range is obtained?",
        "In sensors, sensitivity is best defined as:",
        "Dynamic range of a sensor refers to:",
        "What does Effective Number of Bits (ENOB) describe?",
        "Why is matching sensitivity with ADC resolution important?",
        "Why is calibration important when interfacing sensors with ADCs?"
    ],
    "Analog and digital signal conditioning blocks.xlsx": [
        "What is the main purpose of amplification in signal conditioning?",
        "Why is attenuation necessary in signal conditioning?",
        "What does Signal-to-Noise Ratio (SNR) indicate?",
        "What happens if an amplifier adds significant noise to a signal?",
        "What does Effective Number of Bits (ENOB) describe in an ADC?",
        "Which process removes unwanted frequency components from signals?",
        "What is the role of isolation in signal conditioning?",
        "Which type of filter passes low frequencies and rejects high frequencies?",
        "Which filter type passes a limited range of frequencies?",
        "How are digital filters different from analog filters?",
        "Which sensors require external excitation?",
        "Why is excitation necessary for active sensors?",
        "Why is linearization important in signal conditioning?",
        "Which sensor’s resistance varies significantly with temperature?",
        "What principle does an RTD work on?",
        "What is one advantage of PCB-based signal conditioners?",
        "Which amplifier is ideal for small differential sensor signals?",
        "What is the function of isolation amplifiers?",
        "What do digital isolators do?",
        "Which component protects signal conditioners from voltage spikes?",
        "What technique improves ADC resolution without increasing bit depth?",
        "What is a characteristic of FIR filters?",
        "What is a key feature of IIR filters?",
        "Which temperature sensor does not need external excitation?",
        "What is a key factor in selecting an op-amp for signal conditioning?"
    ],
    "Embedded product development - different stages and specifications.xlsx": [
        "What is the primary purpose of an embedded system?",
        "Which of the following is NOT a main component of an embedded system?",
        "What is the major additional requirement for IoT products compared to embedded systems?",
        "Which of the following describes product re-engineering?",
        "Why is reliability critical in embedded systems?",
        "Which of the following is NOT part of the embedded development life cycle?",
        "At which stage of the EDLC is the product prepared for mass production?",
        "Which stage involves market research and feasibility checks?",
        "Which stage focuses on creating and refining a prototype?",
        "Which activity ensures that the embedded product meets its intended specifications?",
        "What is the primary purpose of embedded system architecture?",
        "What does a proof-of-concept prototype generally include?",
        "Which of the following is an example of a development kit?",
        "Which of these is a common language used for embedded software development?",
        "Which of the following is NOT typically part of an embedded product development team?",
        "What differentiates an alpha prototype from a beta prototype?",
        "Which of the following is checked during implementation testing?",
        "Why are field trials important in embedded product implementation?",
        "Which aspect is considered by software developers during implementation?",
        "Which of the following is NOT a key goal during implementation?"
    ],
    "Requirement breakdown and signal classification.xlsx": [
        "Which of the following best describes a requirement?",
        "Which of these questions does a requirement NOT answer?",
        "Washing machine cycles like wash, rinse, and spin are examples of:",
        "Limiting power consumption to 400 kWh per cycle is an example of:",
        "Restricting maximum width of a device to 27 inches is an example of:",
        "A user-friendly control panel on a washing machine relates to:",
        "Which type of signal is continuous in nature?",
        "Which of these uses light for transmission?",
        "Analyzing a signal by its frequency components refers to:",
        "Categorizing a signal by its frequency range is known as:",
        "PCB reliability can be defined as:",
        "IPC-2221 is a standard providing guidelines for:",
        "Which IPC standard gives guidelines for flex PCB design?",
        "Why is vibration testing important for PCB reliability?",
        "Which environmental factor is a major threat to PCB integrity?"
    ]
}
